; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_16_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 - counter
	)
  (:init
		(= (value c0) 74)
	(= (value c1) 27)
	(= (value c2) 56)
	(= (value c3) 91)
	(= (value c4) 8)
	(= (value c5) 83)
	(= (value c6) 14)
	(= (value c7) 36)
	(= (value c8) 35)
	(= (value c9) 38)
	(= (value c10) 37)
	(= (value c11) 0)
	(= (value c12) 68)
	(= (value c13) 60)
	(= (value c14) 88)
	(= (value c15) 90)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
		)
	)
)

; plan
1. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 8 of 15
2. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 8 of 15
3. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 8 of 15
4. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 8 of 15
5. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 8 of 15
6. (increment c13)
   changed: (value c13) from 60 to 65
   goals met: 8 of 15
7. (increment c13)
   changed: (value c13) from 65 to 70
   goals met: 9 of 15
8. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 9 of 15
9. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 9 of 15
10. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 9 of 15
11. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 9 of 15
12. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 9 of 15
13. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 9 of 15
14. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 9 of 15
15. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 9 of 15
16. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 9 of 15
17. (increment c11)
   changed: (value c11) from 0 to 6
   goals met: 9 of 15
18. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 9 of 15
19. (increment c10)
   changed: (value c10) from 37 to 40
   goals met: 10 of 15
20. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 10 of 15
21. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 10 of 15
22. (increment c8)
   changed: (value c8) from 35 to 37
   goals met: 11 of 15
23. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 11 of 15
24. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 11 of 15
25. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 11 of 15
26. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 11 of 15
27. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 11 of 15
28. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 11 of 15
29. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 11 of 15
30. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 11 of 15
31. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 11 of 15
32. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 11 of 15
33. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 11 of 15
34. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 11 of 15
35. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 11 of 15
36. (increment c11)
   changed: (value c11) from 6 to 13
   goals met: 11 of 15
37. (increment c11)
   changed: (value c11) from 13 to 20
   goals met: 11 of 15
38. (increment c11)
   changed: (value c11) from 20 to 27
   goals met: 11 of 15
39. (increment c11)
   changed: (value c11) from 27 to 34
   goals met: 11 of 15
40. (increment c11)
   changed: (value c11) from 34 to 41
   goals met: 12 of 15
41. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 12 of 15
42. (increment c4)
   changed: (value c4) from 8 to 17
   goals met: 12 of 15
43. (increment c4)
   changed: (value c4) from 17 to 26
   goals met: 12 of 15
44. (increment c4)
   changed: (value c4) from 26 to 35
   goals met: 12 of 15
45. (increment c4)
   changed: (value c4) from 35 to 44
   goals met: 12 of 15
46. (increment c4)
   changed: (value c4) from 44 to 53
   goals met: 12 of 15
47. (increment c4)
   changed: (value c4) from 53 to 62
   goals met: 12 of 15
48. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 12 of 15
49. (increment c4)
   changed: (value c4) from 62 to 72
   goals met: 12 of 15
50. (increment c4)
   changed: (value c4) from 72 to 82
   goals met: 12 of 15
51. (decrement c3)
   changed: (value c3) from 91 to 86
   goals met: 12 of 15
52. (decrement c3)
   changed: (value c3) from 86 to 81
   goals met: 13 of 15
53. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 13 of 15
54. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 13 of 15
55. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 13 of 15
56. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 13 of 15
57. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 13 of 15
58. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 13 of 15
59. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 13 of 15
60. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 13 of 15
61. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 13 of 15
62. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 13 of 15
63. (increment c6)
   changed: (value c6) from 14 to 24
   goals met: 13 of 15
64. (increment c6)
   changed: (value c6) from 24 to 34
   goals met: 13 of 15
65. (increment c6)
   changed: (value c6) from 34 to 44
   goals met: 12 of 15
66. (increment c6)
   changed: (value c6) from 44 to 54
   goals met: 12 of 15
67. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 12 of 15
68. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 12 of 15
69. (decrement c6)
   changed: (value c6) from 54 to 44
   goals met: 12 of 15
70. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 12 of 15
71. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 12 of 15
72. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 12 of 15
73. (decrement c5)
   changed: (value c5) from 83 to 78
   goals met: 11 of 15
74. (decrement c5)
   changed: (value c5) from 78 to 73
   goals met: 11 of 15
75. (decrement c4)
   changed: (value c4) from 82 to 72
   goals met: 11 of 15
76. (decrement c3)
   changed: (value c3) from 81 to 76
   goals met: 11 of 15
77. (decrement c3)
   changed: (value c3) from 76 to 71
   goals met: 12 of 15
78. (decrement c5)
   changed: (value c5) from 73 to 68
   goals met: 11 of 15
79. (decrement c5)
   changed: (value c5) from 68 to 63
   goals met: 11 of 15
80. (decrement c5)
   changed: (value c5) from 63 to 58
   goals met: 11 of 15
81. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 11 of 15
82. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 11 of 15
83. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 11 of 15
84. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 11 of 15
85. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 11 of 15
86. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 11 of 15
87. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 11 of 15
88. (increment c1)
   changed: (value c1) from 27 to 34
   goals met: 11 of 15
89. (increment c1)
   changed: (value c1) from 34 to 41
   goals met: 11 of 15
90. (increment c1)
   changed: (value c1) from 41 to 48
   goals met: 11 of 15
91. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 11 of 15
92. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 11 of 15
93. (increment c1)
   changed: (value c1) from 48 to 55
   goals met: 11 of 15
94. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 11 of 15
95. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 11 of 15
96. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 11 of 15
97. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 11 of 15
98. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 11 of 15
99. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 11 of 15
100. (decrement c0)
   changed: (value c0) from 74 to 69
   goals met: 11 of 15
101. (increment c1)
   changed: (value c1) from 55 to 65
   goals met: 10 of 15
102. (decrement c0)
   changed: (value c0) from 69 to 64
   goals met: 11 of 15
103. (decrement c1)
   changed: (value c1) from 65 to 55
   goals met: 11 of 15
104. (decrement c0)
   changed: (value c0) from 64 to 59
   goals met: 11 of 15
105. (decrement c0)
   changed: (value c0) from 59 to 54
   goals met: 12 of 15
106. (decrement c6)
   changed: (value c6) from 44 to 34
   goals met: 13 of 15
107. (decrement c5)
   changed: (value c5) from 58 to 53
   goals met: 13 of 15
108. (decrement c5)
   changed: (value c5) from 53 to 48
   goals met: 13 of 15
109. (decrement c4)
   changed: (value c4) from 72 to 62
   goals met: 12 of 15
110. (decrement c3)
   changed: (value c3) from 71 to 66
   goals met: 12 of 15
111. (decrement c3)
   changed: (value c3) from 66 to 61
   goals met: 13 of 15
112. (increment c6)
   changed: (value c6) from 34 to 44
   goals met: 12 of 15
113. (decrement c5)
   changed: (value c5) from 48 to 43
   goals met: 13 of 15
114. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 13 of 15
115. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 13 of 15
116. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 13 of 15
117. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 13 of 15
118. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 13 of 15
119. (increment c5)
   changed: (value c5) from 43 to 53
   goals met: 12 of 15
120. (decrement c6)
   changed: (value c6) from 44 to 34
   goals met: 13 of 15
121. (decrement c4)
   changed: (value c4) from 62 to 52
   goals met: 13 of 15
122. (decrement c3)
   changed: (value c3) from 61 to 56
   goals met: 12 of 15
123. (decrement c3)
   changed: (value c3) from 56 to 51
   goals met: 13 of 15
124. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 13 of 15
125. (decrement c2)
   changed: (value c2) from 56 to 55
   goals met: 12 of 15
126. (decrement c2)
   changed: (value c2) from 55 to 54
   goals met: 12 of 15
127. (decrement c2)
   changed: (value c2) from 54 to 53
   goals met: 12 of 15
128. (decrement c2)
   changed: (value c2) from 53 to 52
   goals met: 12 of 15
129. (decrement c2)
   changed: (value c2) from 52 to 51
   goals met: 12 of 15
130. (decrement c2)
   changed: (value c2) from 51 to 50
   goals met: 13 of 15
131. (decrement c1)
   changed: (value c1) from 55 to 45
   goals met: 13 of 15
132. (decrement c0)
   changed: (value c0) from 54 to 49
   goals met: 13 of 15
133. (decrement c0)
   changed: (value c0) from 49 to 44
   goals met: 14 of 15
134. (increment c6)
   changed: (value c6) from 34 to 44
   goals met: 13 of 15
135. (decrement c5)
   changed: (value c5) from 53 to 43
   goals met: 13 of 15
136. (decrement c4)
   changed: (value c4) from 52 to 42
   goals met: 13 of 15
137. (decrement c3)
   changed: (value c3) from 51 to 46
   goals met: 12 of 15
138. (decrement c3)
   changed: (value c3) from 46 to 41
   goals met: 13 of 15
139. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 13 of 15
140. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 13 of 15
141. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 13 of 15
142. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 13 of 15
143. (decrement c2)
   changed: (value c2) from 50 to 45
   goals met: 12 of 15
144. (decrement c2)
   changed: (value c2) from 45 to 40
   goals met: 13 of 15
145. (decrement c1)
   changed: (value c1) from 45 to 35
   goals met: 13 of 15
146. (decrement c0)
   changed: (value c0) from 44 to 39
   goals met: 13 of 15
147. (decrement c0)
   changed: (value c0) from 39 to 34
   goals met: 14 of 15
148. (decrement c6)
   changed: (value c6) from 44 to 34
   goals met: 14 of 15
149. (decrement c5)
   changed: (value c5) from 43 to 33
   goals met: 14 of 15
150. (decrement c4)
   changed: (value c4) from 42 to 32
   goals met: 14 of 15
151. (decrement c3)
   changed: (value c3) from 41 to 36
   goals met: 13 of 15
152. (decrement c3)
   changed: (value c3) from 36 to 31
   goals met: 14 of 15
153. (decrement c2)
   changed: (value c2) from 40 to 35
   goals met: 13 of 15
154. (decrement c2)
   changed: (value c2) from 35 to 30
   goals met: 14 of 15
155. (decrement c1)
   changed: (value c1) from 35 to 25
   goals met: 14 of 15
156. (decrement c0)
   changed: (value c0) from 34 to 29
   goals met: 14 of 15
157. (decrement c0)
   changed: (value c0) from 29 to 24
   goals met: 15 of 15
